toko-api/app/Controllers/ProdukController.php

INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('HAHA1', 'STB Luby DT2 02', '150000')
SELECT *
FROM `produk`
WHERE `produk`.`id` = 2
---
public function create(){
$data = [
'kode_produk' => $this->request->getVar('kode_produk'),
'nama_produk' => $this->request->getVar('nama_produk'),
'harga' => $this->request->getVar('harga')
];
$model = new MProduk();
$model->insert($data);
$produk = $model->find($model->getInsertID());